vekwak/app/controllers/sections_controller.rb

  def create
    @section = Section.new(params[:section])
    if @section.save
---
INSERT INTO "sections" ("created_at", "title", "updated_at") VALUES ('2010-11-30 18:21:14.120391', 0, '2010-11-30 18:21:14.120391')