app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    @comment.student = @student
    unless @comment.content.strip.empty?
      if params[:topic_id]
        topic = Topic.find(params[:topic_id])
        @comment.topic = topic
        topic.comments << @comment
        if @comment.save
          #created.
          respond_to do |rt|
            rt.html{redirect_to topic}
            rt.js{render 'create.js.erb', :locals => {:top_level => true}}
          end
        else
          # smth wrong with save :(
          respond_to do |rt|
            rt.html{redirect_to :action => :new}
            rt.js{render 'fail_create.js.erb', :locals => {:msg => "Fail save."}}
          end
        end
      elsif params[:comment_id]
        comment = Comment.find(params[:comment_id])
        comment.comments << @comment
        @comment.comment = comment
        topic = comment.topic
        if @comment.save
          flash[:notice] = 'Comment was successfully created.'
          respond_to do |rt|
            rt.html{redirect_to topic}
            rt.js{render 'create.js.erb', :locals => {:top_level => false}}
          end
        else
          flash[:notice] = 'smth wrong with save :('
          respond_to do |rt|
            rt.html{redirect_to :action => :new}
            rt.js{render 'fail_create.js.erb', :locals => {:msg => "Fail save."}}
---
SELECT "topics".* FROM "topics" WHERE ("topics"."id" = 1) LIMIT 1
INSERT INTO "comments" ("comment_id", "content", "created_at", "rating", "student_id", "topic_id", "updated_at") VALUES (NULL, 'lololo', '2010-11-23 17:19:30.036985', NULL, 1, 1, '2010-11-23 17:19:30.036985')
SELECT "comments".* FROM "comments" WHERE ("comments"."id" = 2) LIMIT 1
SELECT "students".* FROM "students" WHERE ("students"."id" = 1) LIMIT 1