app/controllers/headman_aul_controller.rb

SELECT "headman_auls".* FROM "headman_auls" ORDER BY created_at DESC LIMIT 1
---
  def list
    @auls = HeadmanAul.order('created_at desc').all

INSERT INTO "headman_auls" ("content", "created_at", "updated_at") VALUES ('lalala', '2010-11-12 19:35:18.884118', '2010-11-12 19:35:18.884118')
SELECT "headman_auls".* FROM "headman_auls" ORDER BY created_at DESC LIMIT 1
---
  def create
    @headman_aul = HeadmanAul.create(params[:headman_aul])
    success = @headman_aul && @headman_aul.save
    if success and @headman_aul.errors.empty?