app/controllers/students_controller.rb

INSERT INTO "students" ("admin", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "crypted_password", "email", "group", "headman", "karma", "last_name", "login", "name", "photo", "rating", "remember_token", "remember_token_expires_at", "salt", "second_name", "updated_at") VALUES ('f', NULL, NULL, NULL, NULL, '2010-10-27 15:13:46.264217', 'f6f076911423c2998226bfce7963747838720d19', 'dfdf@gmia.com', '3241', 'f', 0, 'fdsklfj', 'kmi9', 'llol', NULL, 0, NULL, NULL, '6796f849f3b6133b64e7d0fd16f83ae3d27b5546', 'vvv', '2010-10-27 15:13:46.264217')
UPDATE "students" SET "admin" = 't', "headman" = 't', "updated_at" = '2010-11-12 17:16:21.893063' WHERE ("students"."id" = 9)
---
  def create
    logout_keeping_session!
    @student = Student.create(params[:student])
    success = @student && @student.save

SELECT "students".* FROM "students" WHERE ("students"."id" = 1) LIMIT 1
SELECT "messages".* FROM "messages" WHERE ("messages".student_id = 1)
---
  def show
    @student_show=Student.find_by_id(params[:id])
    @new_msg=@student.messages.collect{|p| p.new}.select{|x| x==true}.size